hxxful/Bootloader/lib/imxrt/sdk_2.3.1_mimxrt1052/boards/evkbimxrt1050/usb_examples/usb_device_phdc_weighscale/bm/weighscale.c
    switch (event)
    {
        case kUSB_DevicePhdcEventInterruptInSendComplete:
        case kUSB_DevicePhdcEventBulkInSendComplete:
        {
            usb_device_endpoint_callback_message_struct_t *message =
                (usb_device_endpoint_callback_message_struct_t *)param;
            if ((NULL != message) && (message->length == USB_UNINITIALIZED_VAL_32))
            {
                error = kStatus_USB_Error;
            }
            else
            {
                error = USB_ShimAgentSendComplete(handle, event, param);
            }
        }
        break;
        case kUSB_DevicePhdcEventDataReceived:
            error = USB_ShimAgentRecvComplete(handle, param);
            break;
        case kUSB_DevicePhdcEventSetFeature:
#if META_DATA_MESSAGE_PREAMBLE_IMPLEMENTED
            /* Meta-data message preamble is enabled */
            g_shimAgent.isMetaDataMessagePreambleEnabled = 1U;
#else
            /* Respond the request with a stall */
            error = kStatus_USB_InvalidRequest;
#endif
            break;
        case kUSB_DevicePhdcEventClearFeature:
#if META_DATA_MESSAGE_PREAMBLE_IMPLEMENTED
            /* Meta-data message preamble is disabled */
            g_shimAgent.isMetaDataMessagePreambleEnabled = 0U;
#else
            /* Respond the request with a stall */
            error = kStatus_USB_InvalidRequest;
#endif
            break;
        case kUSB_DevicePhdcEventGetStatus:
            g_shimAgent.classBuffer[0] = ((uint8_t *)(&g_shimAgent.endpointsHaveData))[0];
            g_shimAgent.classBuffer[1] = ((uint8_t *)(&g_shimAgent.endpointsHaveData))[1];
            request->buffer = g_shimAgent.classBuffer;
            request->length = 2U;
            break;
        default:
            error = kStatus_USB_InvalidRequest;
            break;
    }
    return error;
}

/*!
 * @brief application initialization.
 * This function is the entry for the application (or other usage)
 *
 * @return None.
 */
static void USB_DeviceApplicationInit(void)
{
    USB_DeviceClockInit();
#if (defined(FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT > 0U))
    SYSMPU_Enable(SYSMPU, 0);
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */

    g_shimAgent.speed = USB_SPEED_FULL;
    g_shimAgent.attach = 0U;
    g_shimAgent.deviceHandle = NULL;
    g_shimAgent.recvDataBuffer = (uint8_t *)(&s_RecvDataBuffer[0]);
    g_shimAgent.classBuffer = s_PhdcClassBuffer;

    if (kStatus_USB_Success != USB_DeviceClassInit(CONTROLLER_ID, &g_agentDeviceConfigList, &g_shimAgent.deviceHandle))
    {
        usb_echo("USB device PHDC weighscale demo init failed\r\n");
    }
    else
    {
        usb_echo("USB device PHDC weighscale demo\r\n");
        g_shimAgent.classHandle = g_agentDeviceConfigList.config[0].classHandle;
        /* Initialize the Agent interface */
        AGENT_Init(g_shimAgent.classHandle);
    }
    /* Install isr, set priority, and enable IRQ. */
    USB_DeviceIsrEnable();

    USB_DeviceRun(g_shimAgent.deviceHandle);
}

static void USB_DeviceApplicationTask(uint32_t handle)
{
    switch (appEvent)
    {
        /* bulk in qos is 0x08 - Medium/Best latency, reliability - the time needed
        for a piece of information to send is from 20ms to 200ms, the device should
        wait at least 20ms before sending the data to the host */
        case APP_EVENT_SEND_ASSOCIATION_REQUEST:
            for (uint32_t i = 10000000U; i > 0U; i--)
            {
                if (APP_EVENT_SEND_ASSOCIATION_REQUEST != appEvent)
                {
                    return;
                }
            }
            appEvent = APP_EVENT_UNDEFINED;
            AGENT_SendAssociationRequest(handle, (uint8_t *)(&g_associationRequestData[0]), ASSOCIATION_REQUEST_LENGTH);
            break;
        case APP_EVENT_SEND_DEVICE_CONFIGURATION:
            appEvent = APP_EVENT_UNDEFINED;
            AGENT_SendConfig(handle, g_roivEventRepostConfigurationData, EVENT_REPORT_CONFIGURATION_LENGTH);
            break;
        case APP_EVENT_SEND_MDS_OBJECT:
        {
            appEvent = APP_EVENT_UNDEFINED;
            USB_ShimAgentSendData(handle, AGENT_SEND_DATA_QOS, (uint8_t *)(&g_rorsCmipGetData[0]),
                                  EVENT_RESPONSE_GET_LENGTH);
        }
        break;
        case APP_EVENT_SEND_MEASUREMENT_DATA:
            for (uint32_t i = 10000000U; i > 0U; i--)
            {
                if (APP_EVENT_SEND_MEASUREMENT_DATA != appEvent)
                {
                    return;
                }
            }
            appEvent = APP_EVENT_UNDEFINED;
            APP_WeightScaleSendData(handle, &measurement);
            break;
        default:
            break;
    }
}

#if defined(__CC_ARM) || defined(__GNUC__)
int main(void)
#else
void main(void)
#endif
{
    BOARD_ConfigMPU();
    BOARD_ConfigUSBMPU();

    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
    USB_DeviceApplicationInit();
    while (1U)
    {
#if USB_DEVICE_CONFIG_USE_TASK
        USB_DeviceTaskFn(g_shimAgent.deviceHandle);
#endif
        USB_DeviceApplicationTask(g_shimAgent.classHandle);
    }
}
/* EOF */
